app/controllers/administrators_controller.rb

  def index
    if session[:level] == nil or session[:level] == 0
      redirect_to :controller => :administrators, :action => :login
    elsif !Administrator.OnlineAuthenticate(session[:bunique])
      redirect_to :controller => :administrators, :action => :login
    end
    @administrators = Administrator.all
---
SELECT * FROM `administrators`

  def show
    if session[:level] == nil or session[:level] == 0
      redirect_to :controller => :administrators, :action => :login
    elsif !Administrator.OnlineAuthenticate(session[:bunique])
      redirect_to :controller => :administrators, :action => :login
    end
    @administrator = Administrator.find(params[:id])
---
SELECT * FROM `administrators` WHERE (`administrators`.`id` = 1)

  def edit
    if session[:level] == nil or session[:level] == 0
      redirect_to :controller => :administrators, :action => :login
    elsif !Administrator.OnlineAuthenticate(session[:bunique])
      redirect_to :controller => :administrators, :action => :login
    end
    @administrator = Administrator.find(params[:id])
---
SELECT * FROM `administrators` WHERE (`administrators`.`id` = 1)

  def create
    if session[:level] == nil or session[:level] == 0
      redirect_to :controller => :administrators, :action => :login
    elsif !Administrator.OnlineAuthenticate(session[:bunique])
      redirect_to :controller => :administrators, :action => :login
    end
    @administrator = Administrator.new(params[:administrator])

    respond_to do |format|
      if @administrator.save
---
INSERT INTO `administrators` (`modified_at`, `clearance`, `password`, `created_at`, `admin_name`, `username`) VALUES('2013-02-20 00:00:00', 3, 'admin', '2013-02-20 00:00:00', 'Head Admin', 'admin')

  def update
    if session[:level] == nil or session[:level] == 0
      redirect_to :controller => :administrators, :action => :login
    elsif !Administrator.OnlineAuthenticate(session[:bunique])
      redirect_to :controller => :administrators, :action => :login
    end
    @administrator = Administrator.find(params[:id])
---
SELECT * FROM `administrators` WHERE (`administrators`.`id` = 1)

  def login
    if session[:level] != nil and session[:level] != 0 and session[:bunique] != nil
      redirect_to(dashboard_path)
    end
    if params[:commit]
      @message = Administrator.validateInput(params[:username], params[:password])
      if @message == nil
        if Administrator.authenticate(params[:username], params[:password])
          @administrator = Administrator.findByUsername(params[:username])
---
SELECT * FROM `administrators` WHERE (username = 'John') LIMIT 1