app/controllers/employee_applications_controller.rb

  def index
    @path = 'e'
    @employee_applications = EmployeeApplication.all
---
SELECT * FROM `employee_applications`

  def show
    @new = 'selected'
    @path = 'e'
    @employee_application = EmployeeApplication.find(params[:id])
    @country = Country.getCountryById(@employee_application.country)

    if !@employee_application.employer_country.empty?
      @employerCountry = Country.getCountryById(@employee_application.employer_country)
    end

    @emergencyCountry = Country.getCountryById(@employee_application.emergency_country)
    @state = State.getStateById(@employee_application.state)
    @issueState = State.getStateById(@employee_application.dl_issue)

    if !@employee_application.employer_state.empty?
---
SELECT * FROM `employee_applications` WHERE (`employee_applications`.`id` = 1)
SELECT * FROM `countries` WHERE (`countries`.`id` = 1)
SELECT * FROM `states` WHERE (`states`.`id` = 47)

  def new
    @new = 'selected'
    @path = 'e'
    @employee_application = EmployeeApplication.new

    @countries = Country.getCountries
    @employerCountries = Country.getCountries
    @emergencyCountries = Country.getCountries
    @states = State.getStates
    @issueStates = State.getStates
    @employerStates = State.getStates
    @emergencyStates = State.getStates

    if params[:country] != "" and params[:country] != nil
      @countryId = params[:country]
      selected = Country.find(@countryId)
---
SELECT * FROM `countries` WHERE (`countries`.`id` = 1)


    if params[:state] != "" and params[:state] != nil
      @stateId = params[:state]
      selected = State.find(@stateId)
---
SELECT * FROM `states` WHERE (`states`.`id` = 47)

  def edit
    @new = 'selected'
    @path = 'e'
    @employee_application = EmployeeApplication.find(params[:id])

    @countries = Country.getCountries
    @employerCountries = Country.getCountries
    @emergencyCountries = Country.getCountries
    @states = State.getStates
    @issueStates = State.getStates
    @employerStates = State.getStates
    @emergencyStates = State.getStates

    @stateId = @employee_application.state
    selected = State.find(@stateId)
    @selectedState = selected.name + " " + selected.abbreviation
    @states = @states.insert(0,[@selectedState, @stateId])

    @issueStateId = @employee_application.dl_issue
    selected = State.find(@issueStateId)
    @selectedIssueState = selected.name + " " + selected.abbreviation
    @issueStates = @issueStates.insert(0,[@selectedIssueState, @issueStateId])

    if !@employee_application.employer_state.empty?
---
SELECT * FROM `employee_applications` WHERE (`employee_applications`.`id` = 1)
SELECT * FROM `states` WHERE (`states`.`id` = 47)
SELECT * FROM `states`

    @selectedEmergencyState = selected.name + " " + selected.abbreviation
    @emergencyStates = @emergencyStates.insert(0,[@selectedEmergencyState, @emergencyStateId])

    if !@employee_application.employer_country.empty?
      @employerCountryId = @employee_application.employer_country
      selected = Country.find(@employerCountryId)
---
SELECT * FROM `countries`
SELECT * FROM `countries` WHERE (`countries`.`id` = 1)

  def create
    @employee_application = EmployeeApplication.new(params[:employee_application])

   @stparams = params[:employee_application]
    required_fields = ['experience', 'first_name', 'last_name', 'email', 'marital_status', 'dob', 'gender', 'mobile_phone', 'education', 'address', 'city', 'state', 'zipcode', 'country', 'ssn', 'applying_for', 'employment_type', 'period', 'emergency_name', 'emergency_mobile_number', 'emergency_relationship', 'emergency_address', 'emergency_city', 'emergency_state', 'emergency_zipcode', 'emergency_country']
    if !contactFormvalidity(required_fields, @employee_application)
        #debugger

        flash[:error] = "Please fill in the required fields"
        redirect_to new_employee_application_path(params[:employee_application])
    elsif @stparams[:signed].eql?("0")
      flash[:error] = "You have to certify that the information you provided is correct. Please check the checkbox at the bottom of form."
        redirect_to new_employee_application_path(params[:employee_application])
    else
      @employee_application.application_code = EmployeeApplication.generateAppID(@stparams[:first_name], @stparams[:last_name], @stparams[:applying_for])
      if @employee_application.save
---
INSERT INTO `employee_applications` (`country`, `medication`, `referrer`, `accepted`, `emergency_city`, `application_code`, `gender`, `home_phone`, `other_phone`, `education`, `employment_type`, `physical_disability`, `experience`, `employer_name`, `employer_country`, `submitted_on`, `period`, `employer_state`, `emergency_mobile_number`, `emergency_zipcode`, `summary`, `dob`, `state`, `zipcode`, `dl_number`, `employer_number`, `address`, `city`, `dl_issue`, `applying_for`, `employer_address`, `employer_zipcode`, `emergency_address`, `last_name`, `marital_status`, `mobile_phone`, `ssn`, `emergency_name`, `emergency_relationship`, `signed`, `emergency_country`, `remarks`, `first_name`, `email`, `employer_city`, `emergency_home_number`, `emergency_state`) VALUES('1', '', 'Friend', NULL, 'norfolk', 'EI201332495555SI', 'Male', '546+45489653', '79463749+', 'A College Graduate', 'Full_Time_40hr', '', '1-3years', '', '', '2013-03-24', 'DAY', '', '7897631', '45353', '', '1982-11-27', '47', '52896', '4565475676', '', '44 east st', 'norfolk', '16', 'Instructor', '', '', '44 east str', 'Ibenye', 'Single', '54387976398', '3443904', 'David', 'Uncle', 1, '1', NULL, 'Silver', 'ag-silver@live.com', '', '', '11')

  def update
    @employee_application = EmployeeApplication.find(params[:id])
    @employee_application_params = params[:employee_application]
    required_fields = ['experience', 'first_name', 'last_name', 'email', 'marital_status', 'dob', 'gender', 'mobile_phone', 'education', 'address', 'city', 'state', 'zipcode', 'country', 'ssn', 'applying_for', 'employment_type', 'period', 'emergency_name', 'emergency_mobile_number', 'emergency_relationship', 'emergency_address', 'emergency_city', 'emergency_state', 'emergency_zipcode', 'emergency_country']
    if !contactFormvalidity(required_fields, @employee_application_params)
        #debugger

        flash[:error] = "Please fill in the required fields"
        redirect_to edit_employee_application_path(@employee_application)

    else
      @employee_application_params['application_code'] = EmployeeApplication.generateAppID(@employee_application_params['first_name'], @employee_application_params['last_name'], @employee_application_params['applying_for'])

      respond_to do |format|
        if @employee_application.update_attributes(@employee_application_params)
---
SELECT * FROM `employee_applications` WHERE (`employee_applications`.`id` = 1)
UPDATE `employee_applications` SET `application_code` = 'EI201332495923SI', `experience` = '4-6years' WHERE `id` = 1