app/controllers/pages_controller.rb

SELECT * FROM `pages`
SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
---
  def edit
    if session[:level] == nil or session[:level] == 0
      redirect_to :controller => :administrators, :action => :login
    elsif !Administrator.OnlineAuthenticate(session[:bunique])
      redirect_to :controller => :administrators, :action => :login
    end
    @pages = Page.all
    @page = Page.find(params[:id])

SELECT * FROM `pages`
---
  def index
    if session[:level] == nil or session[:level] == 0
      redirect_to :controller => :administrators, :action => :login
    elsif !Administrator.OnlineAuthenticate(session[:bunique])
      redirect_to :controller => :administrators, :action => :login
    end
    @pages = Page.all

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
---
  def show
    if session[:level] == nil or session[:level] == 0
      redirect_to :controller => :administrators, :action => :login
    elsif !Administrator.OnlineAuthenticate(session[:bunique])
      redirect_to :controller => :administrators, :action => :login
    end
    id = params[:id]
    page = Page.find(id)

INSERT INTO `pages` (`body`, `title`, `name`, `path_name`) VALUES('B-Unique Barber Academy was established in 1999 it\'s the only barber school of it\'s kind in South Carolina. We are simply the best in South Carolina. Yes, we realize that is a bold statement, but when over 60% of our partner companies come through client referrals, we feel confident in making this statement.\r\n\r\nYou can be assured that our number one priority is always our students getting the very best possible training.\r\n\r\nAt B-Unique our instructors have over 25 years of experience in the Personal Care industry.\r\n\r\nWe are centrally located in Greenville, South Carolina, to better serve your needs. New locations coming soon to Anderson, SC., and Spartanburg, SC.\r\n\r\nIf you are a licensed barber instructor and have a passion for helping others learn the barber industry, please begin the process by completing an Instructor\'s Application on this website. ', 'About Us', 'About Us', 'about')
---
  def create
    if session[:level] == nil or session[:level] == 0
      redirect_to :controller => :administrators, :action => :login
    elsif !Administrator.OnlineAuthenticate(session[:bunique])
      redirect_to :controller => :administrators, :action => :login
    else
    @page = Page.new(params[:page])
    if @page.save

SELECT * FROM `pages` WHERE (`pages`.`id` = 1)
UPDATE `pages` SET `body` = 'We are pleased to learn of your interest in B-Unique Barber Academy. The mere fact that you clicked on this web-site indicates that you are ambitious and serious about your future. B-Unique is licensed by the South Carolina Board of Barber Examiners, and during our most recent inspection, performed on 5/22/2012, produced a passing grade of 100%! It is our priority at B-Unique to ensure that you attain your goal of becoming a licensed professional. On this site you will find information and facts about B-Unique Barber Academy and how to get you started on your new career path.\r\n\r\n\r\nWe look forward to having you as a student in the near future. Don\'t let this opportunity slip through your fingers. Classes are filling up fast.\r\n\r\nContact the Admissions office at (864)233-0056 to schedule an appointment to enroll. Ask for Fortrail Chiles. Enrollment appointments are scheduled for Tuesday and Wednesday, from 9am to 1pm.' WHERE `id` = 1
---
  def update
    if session[:level] == nil or session[:level] == 0
      redirect_to :controller => :administrators, :action => :login
    elsif !Administrator.OnlineAuthenticate(session[:bunique])
      redirect_to :controller => :administrators, :action => :login
    else
      @page = Page.find(params[:id])
      @page.update_attributes!(params[:page])

SELECT * FROM `pages` WHERE (path_name = 'about') LIMIT 1
---
  def about
    @about = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'calendar') LIMIT 1
---
  def calendar
    @calendar = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'clinical') LIMIT 1
---
  def clinical
    @clinical = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'complaint') LIMIT 1
---
  def complaint
    @complaint = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'contact') LIMIT 1
---
  def contact
    @contact = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'events') LIMIT 1
---
  def events
    @event = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'faq') LIMIT 1
---
  def faq
    @faq = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'financial') LIMIT 1
---
  def financial
    @financial = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'haircare') LIMIT 1
---
  def haircare
    @hair = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'friends') LIMIT 1
---
  def friends
    @friends = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'info') LIMIT 1
---
  def info
    @info = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'home') LIMIT 1
---
  def home
    @home = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'job') LIMIT 1
---
  def job
    @job = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'news') LIMIT 1
---
  def news
    @news = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'owner') LIMIT 1
---
  def owner
    @owner = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'photodetail') LIMIT 1
---
  def photodetail
    @photo = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'service') LIMIT 1
---
  def service
    @service = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'testimony') LIMIT 1
---
  def testimony
    @testimony = 'selected'
    @pages = Page.all

SELECT * FROM `pages` WHERE (path_name = 'win') LIMIT 1
---
  def win
    @win = 'selected'
    @pages = Page.all