app/controllers/service_categories_controller.rb

  def index
    if session[:level] == nil or session[:level] == 0
      redirect_to :controller => :administrators, :action => :login
    elsif !Administrator.OnlineAuthenticate(session[:bunique])
      redirect_to :controller => :administrators, :action => :login
    else
      @pages = Page.all
      @service_categories = ServiceCategory.all
---
SELECT * FROM `pages`
SELECT * FROM `service_categories`

  def new
    if session[:level] == nil or session[:level] == 0
      redirect_to :controller => :administrators, :action => :login
    elsif !Administrator.OnlineAuthenticate(session[:bunique])
      redirect_to :controller => :administrators, :action => :login
    else
      @pages = Page.all
---
SELECT * FROM `pages`