app/controllers/student_applications_controller.rb

  def manage
    if session[:level] == nil or session[:level] == 0
      redirect_to :controller => :administrators, :action => :login
    elsif !Administrator.OnlineAuthenticate(session[:bunique])
      redirect_to :controller => :administrators, :action => :login
    else
      @path = 's'
      @student_application = StudentApplication.find(params[:id])
---
SELECT * FROM `student_applications` WHERE (admission_session = '2013 - October Admission')