app/controllers/student_applications_controller.rb

  def index
    @path = 's'
    @student_applications = StudentApplication.all
---
SELECT * FROM `student_applications`

  def show
    @path = 's'
    @new = 'selected'
    @student_application = StudentApplication.find(params[:id])
    @country = Country.getCountryById(@student_application.country)

    if !@student_application.employer_country.empty?
      @employerCountry = Country.getCountryById(@student_application.employer_country)
    end

    @emergencyCountry = Country.getCountryById(@student_application.emergency_country)
    @state = State.getStateById(@student_application.state)
    @issueState = State.getStateById(@student_application.dl_issue)

    if !@student_application.employer_state.empty?
---
SELECT * FROM `student_applications` WHERE (`student_applications`.`id` = 0)
SELECT * FROM `countries` WHERE (`countries`.`id` = 1)
SELECT * FROM `states` WHERE (`states`.`id` = 1)

  def new
    @path = 's'
    @new = 'selected'
    @student_application = StudentApplication.new
    @countries = Country.getCountries
    @employerCountries = Country.getCountries
    @emergencyCountries = Country.getCountries
    @states = State.getStates
    @issueStates = State.getStates
    @employerStates = State.getStates
    @emergencyStates = State.getStates
    @sessions = StudentApplication.calculateSession

    if params[:country] != "" and params[:country] != nil
      @countryId = params[:country]
      selected = Country.find(@countryId)
---
SELECT * FROM `countries` WHERE (`countries`.`id` = 1)


    if params[:state] != "" and params[:state] != nil
      @stateId = params[:state]
      selected = State.find(@stateId)
---
SELECT * FROM `states` WHERE (`states`.`id` = 16)

  def edit
    @path = 's'
    @new = 'selected'
    @student_application = StudentApplication.find(params[:id])

    @countries = Country.getCountries
    @employerCountries = Country.getCountries
    @emergencyCountries = Country.getCountries
    @states = State.getStates
    @issueStates = State.getStates
    @employerStates = State.getStates
    @emergencyStates = State.getStates
    @sessions = StudentApplication.calculateSession

    @stateId = @student_application.state
    selected = State.find(@stateId)
    @selectedState = selected.name + " " + selected.abbreviation
    @states = @states.insert(0,[@selectedState, @stateId])

    @issueStateId = @student_application.dl_issue
    selected = State.find(@issueStateId)
    @selectedIssueState = selected.name + " " + selected.abbreviation
    @issueStates = @issueStates.insert(0,[@selectedIssueState, @issueStateId])

    if !@student_application.employer_state.empty?
---
SELECT * FROM `student_applications` WHERE (`student_applications`.`id` = 11)
SELECT * FROM `states` WHERE (`states`.`id` = 1)
SELECT * FROM `states`

    @selectedEmergencyState = selected.name + " " + selected.abbreviation
    @emergencyStates = @emergencyStates.insert(0,[@selectedEmergencyState, @emergencyStateId])

    if !@student_application.employer_country.empty?
      @employerCountryId = @student_application.employer_country
      selected = Country.find(@employerCountryId)
---
SELECT * FROM `countries`
SELECT * FROM `countries` WHERE (`countries`.`id` = 1)

  def create
    @student_application = StudentApplication.new(params[:student_application])
    @stparams = params[:student_application]
    required_fields = ['admission_session', 'first_name', 'last_name', 'email', 'marital_status', 'dob', 'gender', 'mobile_phone', 'education', 'address', 'city', 'state', 'zipcode', 'country', 'ssn', 'applying_for', 'student_type', 'period', 'emergency_name', 'emergency_mobile_number', 'emergency_relationship', 'emergency_address', 'emergency_city', 'emergency_state', 'emergency_zipcode', 'emergency_country']
    if !contactFormvalidity(required_fields, @student_application)
        #debugger

        flash[:error] = "Please fill in the required fields"
        redirect_to new_student_application_path(params[:student_application])
    elsif @stparams[:signed].eql?("0")
      flash[:error] = "You have to certify that the information you provided is correct. Please check the checkbox at the bottom of form."
        redirect_to new_student_application_path(params[:student_application])
    else
      @student_application.application_code = StudentApplication.generateAppID(@stparams[:first_name], @stparams[:last_name], @stparams[:applying_for])
      if @student_application.save
---
INSERT INTO `student_applications` (`other_phone`, `city`, `country`, `first_name`, `last_name`, `application_code`, `dob`, `mobile_phone`, `education`, `admission_session`, `applying_for`, `dl_number`, `dl_issue`, `employer_city`, `emergency_state`, `state`, `period`, `employer_name`, `employer_address`, `emergency_zipcode`, `email`, `zipcode`, `amount`, `employer_state`, `emergency_relationship`, `emergency_address`, `gender`, `emergency_mobile_number`, `student_type`, `employer_number`, `emergency_name`, `emergency_city`, `emergency_country`, `referrer`, `submitted_on`, `paid`, `marital_status`, `committment`, `physical_disability`, `medication`, `remarks`, `signed`, `ssn`, `home_phone`, `address`, `emergency_home_number`, `summary`, `employer_zipcode`, `employer_country`, `accepted`) VALUES('', 'norfolk', '1', 'John', 'Smith', 'SRB20133881647JS', '1984-01-24', '7203641226', 'A GED Graduate', 'January Admission', 'Registered Barber', '57655758768', '13', '', '8', '11', 'DAY', '', '', '44646', 'ag-silver@live.com', '35675', NULL, '', 'Wife', '404 44th street', 'Male', '78686865', 'Full_Time_40hr', '', 'Mary', 'norfolk', '1', 'Yellow Pages', '2013-03-08 00:00:00', NULL, 'Married', 'I am ready to get started', '', '', NULL, 1, '57573473', '', '2345 e fredy street', '', 'testing', '', '', NULL)

  def update
    @student_application = StudentApplication.find(params[:id])
    @student_application_params = params[:student_application]
    required_fields = ['admission_session', 'first_name', 'last_name', 'email', 'marital_status', 'dob', 'gender', 'mobile_phone', 'education', 'address', 'city', 'state', 'zipcode', 'country', 'ssn', 'applying_for', 'student_type', 'period', 'emergency_name', 'emergency_mobile_number', 'emergency_relationship', 'emergency_address', 'emergency_city', 'emergency_state', 'emergency_zipcode', 'emergency_country']
    if !contactFormvalidity(required_fields, @student_application_params)
        #debugger

        flash[:error] = "Please fill in the required fields"
        redirect_to edit_student_application_path(@student_application)

    else
      @student_application_params['application_code'] = StudentApplication.generateAppID(@student_application_params['first_name'], @student_application_params['last_name'], @student_application_params['applying_for'])

      respond_to do |format|
        if @student_application.update_attributes(@student_application_params)
---
SELECT * FROM `student_applications` WHERE (`student_applications`.`id` = 11)
UPDATE `student_applications` SET `medication` = 'test drug', `emergency_state` = '7', `summary` = 'test essay teah', `physical_disability` = 'test drug', `dl_issue` = '6', `state` = '47' WHERE `id` = 11